{
  "backend/main.mo": "Motoko backend defining timeline, task, routine, cycle types, user profiles, access control, and build info, with storage mixins and event store scaffolding.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with high-confidence metadata.",
  "frontend-file-summaries.txt": "List of concise summaries for various frontend OmniTrace modules covering storage, analytics, UI, and session systems.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme CSS variables and base layer rules.",
  "frontend/index.html": "HTML entry point setting up fonts and mounting the React app root.",
  "frontend/PRODUCTION_PROMOTION.md": "Production promotion checklist detailing deployment, cache clearing, URL verification, and build‑info validation steps.",
  "frontend/src/App.tsx": "Main React app handling startup initialization, error recovery, screen routing, and session bootstrap.",
  "frontend/src/constants/buildInfo.ts": "Exports the frontend build label set to Version 8.",
  "frontend/src/hooks/useActor.ts": "React hook creating authenticated or anonymous backend actors and invalidating dependent queries on identity change.",
  "frontend/src/hooks/useBuildInfo.ts": "React Query hook that fetches backend build info using the active actor with retry and refetch behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch hook with start, pause, reset, and elapsed‑time tracking using requestAnimationFrame.",
  "frontend/src/hooks/useTimer.ts": "Implements a countdown timer hook with start, pause, reset, duration control, and completion tracking.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, and custom themes including cognitive glow, focus ring, and timeline visual styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/omni/analytics/categoryBreakdown.ts": "Computes total and percentage duration per activity category from derived time segments.",
  "frontend/src/omni/analytics/dailySummary.ts": "Generates daily insight summaries based on activity segments, detecting focus windows, distractions, rest patterns, and recovery gaps.",
  "frontend/src/omni/analytics/driftDetection.ts": "Analyzes activity events to detect cognitive drift, identifying focus decay patterns or distraction clustering.",
  "frontend/src/omni/analytics/focusScore.ts": "Computes a 0–100 focus score from event-derived segments, adjusting for focus duration, distraction rate, rest balance, and switching behavior.",
  "frontend/src/omni/analytics/heatmap.ts": "Generates a time‑binned mental‑load heatmap based on segment overlap and category weights, then smooths intensity values.",
  "frontend/src/omni/analytics/insights.ts": "Derives insights such as most frequent activity, longest focus session, context switches, and peak productivity hour from segments and events.",
  "frontend/src/omni/analytics/metrics.ts": "Calculates session metrics including active, idle, background time, context switches, and focus density from ordered events.",
  "frontend/src/omni/analytics/smartMerging.ts": "Merges raw segments into higher‑level cognitive patterns like Exploration Sessions, Micro‑Distractions, and Recovery Gaps based on mode-specific thresholds.",
  "frontend/src/omni/analytics/titles.ts": "Assigns gamified titles by evaluating long focus sessions, handling distractions, and exploration patterns using merged segments.",
  "frontend/src/omni/engine/idleDetection.ts": "Detects idle and active states via user interactions and logs IDLE_START/IDLE_END events with timers.",
  "frontend/src/omni/engine/queries.ts": "Provides filtered event queries and nearest-event lookup using ledger storage functions.",
  "frontend/src/omni/engine/timeEngine.ts": "Derives activity segments from ordered events and supports querying which segment covers a given timestamp.",
  "frontend/src/omni/forensics/reconstruct.ts": "Builds a forensic timeline by querying events, deriving and merging segments, and detecting gaps between them.",
  "frontend/src/omni/hooks/useCognitiveMode.ts": "Manages cognitive mode state with localStorage persistence and exposes a setter.",
  "frontend/src/omni/hooks/useHeatmapZoom.ts": "Provides heatmap zoom state with wheel and pinch gesture handling and maps zoom levels to bin counts.",
  "frontend/src/omni/hooks/useSmoothedFocusPresentation.ts": "Smoothly animates focus score and label changes using lerp unless reduced-motion is preferred.",
  "frontend/src/omni/hooks/useTodayOmniEvents.ts": "Loads today’s events with periodic refresh and exposes loading, error, and manual refresh control.",
  "frontend/src/omni/instrumentation/context.ts": "Stores and retrieves the current screen and mode for instrumentation context.",
  "frontend/src/omni/instrumentation/logger.ts": "Creates and appends timestamped OmniEvents for logging actions.",
  "frontend/src/omni/privacy/export.ts": "Exports stored data to JSON or CSV by reading from IndexedDB and triggering file downloads.",
  "frontend/src/omni/privacy/privateMode.ts": "Tracks and persists a local private-mode flag with toggle and control helpers.",
  "frontend/src/omni/privacy/wipe.ts": "Provides full data wipe operations and recovery-safe database deletion, logging a wipe event first.",
  "frontend/src/omni/search/index.ts": "Runs event searches using time, category, confidence, keyword, and duration filters.",
  "frontend/src/omni/search/presets.ts": "Defines preset search filters for common anomaly queries such as idle or manual events.",
  "frontend/src/omni/session/sessionTracker.ts": "Tracks session lifecycle and visibility changes, logging session and foreground/background events.",
  "frontend/src/omni/session/startup.ts": "Initializes storage, performs recovery, starts a new session, and activates the tracker.",
  "frontend/src/omni/storage/idb.ts": "Implements an IndexedDB storage layer with idempotent init, CRUD operations, and schema setup.",
  "frontend/src/omni/storage/ledger.ts": "Provides append and read helpers wrapping IndexedDB storage for event operations.",
  "frontend/src/omni/storage/recovery.ts": "Closes unclosed sessions on startup and logs a recovery event if needed.",
  "frontend/src/omni/types.ts": "Defines core OMNITRACE types including events, sessions, derived and merged segments, and export metadata.",
  "frontend/src/omni/ui/AppShell.tsx": "Implements the main app shell with navigation, focus score display, private mode, and cognitive mode controls.",
  "frontend/src/omni/ui/categoryColors.ts": "Defines color and label mappings for activity categories using OKLCH colors.",
  "frontend/src/omni/ui/CognitiveModeSwitch.tsx": "Provides a pill-style button group for switching between cognitive modes.",
  "frontend/src/omni/ui/DailySummaryCard.tsx": "Renders a card showing daily insights from the analytics summary.",
  "frontend/src/omni/ui/FocusScoreRing.tsx": "Displays the focus score with animated ring styling and fallback for insufficient data.",
  "frontend/src/omni/ui/HeatmapBar.tsx": "Draws a horizontal heatmap on canvas using intensity-based OKLCH gradients.",
  "frontend/src/omni/ui/HeatmapZoomControls.tsx": "UI controls for adjusting heatmap zoom level via buttons and slider.",
  "frontend/src/omni/ui/PrivateModeToggle.tsx": "Provides a toggle button to enable or disable Private Mode.",
  "frontend/src/omni/ui/States.tsx": "Reusable components for loading, empty, inline notice, and startup error states.",
  "frontend/src/omni/ui/timelineCognitiveStyle.ts": "Computes cognitive styling values based on duration, category, and confidence, exposing CSS variable helpers.",
  "frontend/src/omni/ui/TitlesStrip.tsx": "Displays earned titles as badges with an icon when available.",
  "frontend/src/screens/ActivityMapScreen.tsx": "Displays an activity category breakdown over a selected date range using queried events and progress visuals.",
  "frontend/src/screens/DashboardScreen.tsx": "Generates session metrics, insights, titles, and summaries from events within a chosen date range.",
  "frontend/src/screens/ForensicScreen.tsx": "Reconstructs and displays detailed event timelines for a specified time window with expandable segment views.",
  "frontend/src/screens/ManualEventDialog.tsx": "Modal dialog for manually creating and storing events with category, timing, keywords, and notes.",
  "frontend/src/screens/SearchScreen.tsx": "Provides advanced search with filters, presets, and result listings for querying stored events.",
  "frontend/src/screens/SettingsScreen.tsx": "Implements privacy controls, data export/wipe actions, and frontend/backend build info display with version mismatch detection and refresh handling.",
  "frontend/src/screens/StopwatchTimerScreen.tsx": "Provides stopwatch and timer tools with time formatting, duration inputs, and controls for start, pause, reset, and countdown.",
  "frontend/src/screens/TimelineScreen.tsx": "Displays a filterable timeline or heatmap of recorded events, supports cognitive modes, smart merging, manual event creation, and zoom controls.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, store, persist, and clear URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the app’s UI styling.",
  "project_state.json": "Project state metadata describing architecture, constraints, features, issues, and versioning for the OMNITRACE system."
}