{
  "backend/main.mo": "Motoko backend defining timeline, task, routine, and cycle types with user-specific event stores, access control, and build info plus profile APIs.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for runtime mode and OMNIBRAIN behavior changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend OMNITRACE files covering storage, engine, analytics, UI, and privacy modules.",
  "frontend/index.css": "Tailwind base/theme definitions providing light and dark mode color variables and global styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/PRODUCTION_PROMOTION.md": "Production deployment checklist detailing version verification, cache clearing steps, and post-deployment validation.",
  "frontend/src/App.tsx": "Main React app handling session initialization, error recovery, and routing between all OMNITRACE screens.",
  "frontend/src/constants/buildInfo.ts": "Defines the frontend build label used in version display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, invalidating and refetching dependent queries when it changes.",
  "frontend/src/hooks/useBuildInfo.ts": "Fetches build info from the backend using the actor, with retry, caching, and refetch rules.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login, logout, and stored identities.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch with start, pause, reset, and real‑time elapsed tracking via requestAnimationFrame.",
  "frontend/src/hooks/useTimer.ts": "Provides a countdown timer with start, pause, reset, duration setting, and completion detection.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, and custom UI effects including cognitive glow, focus rings, and color variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/omni/analytics/categoryBreakdown.ts": "Computes total and percentage time spent per category by analyzing derived segments.",
  "frontend/src/omni/analytics/dailySummary.ts": "Generates deterministic daily insights from event segments, detecting focus windows, distractions, rest patterns, and recovery gaps.",
  "frontend/src/omni/analytics/driftDetection.ts": "Detects cognitive drift by analyzing focus duration consistency and distraction clustering, returning recommendations when patterns appear.",
  "frontend/src/omni/analytics/focusScore.ts": "Computes a 0–100 focus score from event-derived segments, applying duration, distraction, rest, and switching heuristics to return a labeled result.",
  "frontend/src/omni/analytics/heatmap.ts": "Generates a mental-load heatmap by binning time, weighting segment categories, and smoothing intensity values.",
  "frontend/src/omni/analytics/insights.ts": "Produces high-level insights such as most frequent activity, longest focus session, context switches, and peak productivity hours from segments.",
  "frontend/src/omni/analytics/metrics.ts": "Calculates session metrics including active/background/idle time, context switches, and focus density based on event transitions.",
  "frontend/src/omni/analytics/smartMerging.ts": "Merges raw segments into higher-level patterns like Exploration Sessions, Micro-Distractions, or Recovery Gaps based on cognitive mode thresholds.",
  "frontend/src/omni/analytics/titles.ts": "Awards micro-gamification titles like Flow Architect or Focus Breaker by analyzing focus duration, distractions, and merged segment patterns.",
  "frontend/src/omni/engine/idleDetection.ts": "Tracks user idle/active state via interaction events and logs IDLE_START/IDLE_END events with automatic confidence.",
  "frontend/src/omni/engine/queries.ts": "Provides filtered event queries and nearest-event lookup using ledger storage with optional category, confidence, and keyword filters.",
  "frontend/src/omni/engine/timeEngine.ts": "Derives deterministic activity segments from events and supports retrieving the active segment at a timestamp.",
  "frontend/src/omni/forensics/reconstruct.ts": "Builds a forensic timeline by querying events, deriving and merging segments, and identifying time gaps.",
  "frontend/src/omni/hooks/useCognitiveMode.ts": "React hook that manages cognitive mode with localStorage persistence.",
  "frontend/src/omni/hooks/useHeatmapZoom.ts": "Provides zoom state and handlers for wheel and pinch gestures to adjust heatmap bin density.",
  "frontend/src/omni/hooks/useOmniBrainRuntimeMode.ts": "Manages OMNIBRAIN runtime mode (local vs API) with storage, events, and cross-component updates.",
  "frontend/src/omni/hooks/useSmoothedFocusPresentation.ts": "Smoothly animates focus score and label changes using lerp unless reduced motion is preferred.",
  "frontend/src/omni/hooks/useTodayOmniEvents.ts": "Loads today’s events and refreshes them periodically with error/loading tracking.",
  "frontend/src/omni/instrumentation/context.ts": "Stores and returns the current instrumentation context for screen and mode.",
  "frontend/src/omni/instrumentation/logger.ts": "Creates and appends timestamped OmniEvents for centralized logging.",
  "frontend/src/omni/omnibrain/chatStorage.ts": "Provides localStorage-based persistence for chat messages with confidence and follow-up fields.",
  "frontend/src/omni/omnibrain/contextScope.ts": "Computes time ranges for today/week/all and loads events for a given scope.",
  "frontend/src/omni/omnibrain/engine.ts": "Detects user intent and generates assistant responses, including routing external-AI queries to an unavailable response.",
  "frontend/src/omni/omnibrain/helpSearch.ts": "Keyword tokenizer and scorer for retrieving relevant knowledge base entries.",
  "frontend/src/omni/omnibrain/instrumentation.ts": "Logs OMNIBRAIN open and submit actions with contextual metadata.",
  "frontend/src/omni/omnibrain/knowledgeBase.ts": "Static help articles with titles, keywords, and answers for OMNIBRAIN queries.",
  "frontend/src/omni/omnibrain/modes.ts": "Defines intelligence modes with labels/descriptions and a renderer that formats facts differently per mode.",
  "frontend/src/omni/omnibrain/suggestedQuestions.ts": "Provides a fixed list of deterministic English suggested user questions.",
  "frontend/src/omni/omnibrain/templates.ts": "Generates structured fact payloads about distractions and focus drops using derived segments and metrics.",
  "frontend/src/omni/omnibrain/useOmniBrainChat.ts": "React hook managing chat messages with persistent storage and basic CRUD operations.",
  "frontend/src/omni/privacy/export.ts": "Implements full data export to JSON and CSV by reading events, sessions, and metadata from storage.",
  "frontend/src/omni/privacy/privateMode.ts": "Manages a boolean Private Mode flag in localStorage with toggle and helpers.",
  "frontend/src/omni/privacy/wipe.ts": "Provides full data wipe functions, logging a wipe event and handling recovery-safe deletion.",
  "frontend/src/omni/search/index.ts": "Runs local event search with composable filters mapped to queryEvents and duration post-filters.",
  "frontend/src/omni/search/presets.ts": "Defines preset search filters for common anomaly queries like long idle or manual events.",
  "frontend/src/omni/session/sessionTracker.ts": "Tracks session lifecycle and visibility changes, persisting session events to storage.",
  "frontend/src/omni/session/startup.ts": "Initializes storage, performs recovery, starts a new session, and sets up session tracking.",
  "frontend/src/omni/storage/idb.ts": "Provides IndexedDB storage with idempotent init, CRUD for events/sessions, and crash-safe metadata updates.",
  "frontend/src/omni/storage/ledger.ts": "Thin wrapper for appending and reading events through the IndexedDB storage layer.",
  "frontend/src/omni/storage/recovery.ts": "Performs startup recovery by closing unclosed sessions and logging a recovery event.",
  "frontend/src/omni/types.ts": "Defines core data model types including events, sessions, segments, metadata, and enums.",
  "frontend/src/omni/ui/AppShell.tsx": "Provides the main app layout with header controls, navigation tabs, focus score, private mode, and cognitive mode handling.",
  "frontend/src/omni/ui/categoryColors.ts": "Defines category-specific colors and labels using harmonized oklch palettes.",
  "frontend/src/omni/ui/CognitiveModeSwitch.tsx": "Renders a pill-style switch to toggle between cognitive modes like focus, flow, recovery, and analysis.",
  "frontend/src/omni/ui/DailySummaryCard.tsx": "Displays a card listing daily insights generated from a DailySummary object.",
  "frontend/src/omni/ui/FocusScoreRing.tsx": "Shows a focus score ring with dynamic styling or a fallback message when insufficient data is available.",
  "frontend/src/omni/ui/HeatmapBar.tsx": "Draws a horizontal heatmap on a canvas using bins and an Indigo→Cyan→Red color scale.",
  "frontend/src/omni/ui/HeatmapZoomControls.tsx": "Provides zoom-in/out buttons and a slider to adjust heatmap zoom level.",
  "frontend/src/omni/ui/PrivateModeToggle.tsx": "Button that toggles the application's private mode state with an eye icon indicator.",
  "frontend/src/omni/ui/States.tsx": "Collection of reusable components for loading, empty, inline notice, and startup error UI states.",
  "frontend/src/omni/ui/timelineCognitiveStyle.ts": "Computes cognitive style parameters (intensity, glow, elevation) for timeline items and exposes CSS variable helpers.",
  "frontend/src/omni/ui/TitlesStrip.tsx": "Displays a row of user titles using badges, or nothing if no titles exist.",
  "frontend/src/screens/ActivityMapScreen.tsx": "Activity map screen that loads events, supports date-range filtering, and shows category breakdown with UI controls.",
  "frontend/src/screens/DashboardScreen.tsx": "Displays session metrics, insights, summaries, titles, and drift detection with date-range queries for events.",
  "frontend/src/screens/ForensicScreen.tsx": "Provides a UI to reconstruct and browse detailed event timelines within a selected time window.",
  "frontend/src/screens/ManualEventDialog.tsx": "Dialog for creating manual events with title, category, timing, duration, keywords, and notes.",
  "frontend/src/screens/OmniBrainScreen.tsx": "Chat interface for the OmniBrain assistant supporting context scopes, intelligence modes, history, and runtime-mode handling.",
  "frontend/src/screens/SearchScreen.tsx": "Advanced event search screen with filters, presets, and result listing.",
  "frontend/src/screens/SettingsScreen.tsx": "Renders the Privacy & Control settings UI with build info, OMNIBRAIN runtime mode, data export, data wipe, and backend version mismatch handling.",
  "frontend/src/screens/StopwatchTimerScreen.tsx": "Provides stopwatch and countdown timer functionality with formatted time display, adjustable duration, and basic controls.",
  "frontend/src/screens/TimelineScreen.tsx": "Displays the live timeline with filtering, cognitive mode styling, heatmap view, smart merging, and manual event entry support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugins enabled.",
  "project_state.json": "Project metadata describing architecture, constraints, known issues, and existing features for the OMNITRACE system."
}