{
  "kind": "build_request",
  "title": "Add Settings toggle to switch OMNIBRAIN between Local and API modes (API currently unavailable)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-85",
      "text": "Add a device-local setting that lets the user choose an OMNIBRAIN runtime mode with two options: “Local (Offline)” and “API (Online)”. Persist the selection in localStorage so it survives reloads.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Want to add a toggle in Settings so you can switch between local and API modes easily?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "A new localStorage key is used to store the selected OMNIBRAIN runtime mode.",
        "Default mode is “Local (Offline)” when no prior selection exists or stored value is invalid.",
        "Changing the mode updates immediately without requiring a page refresh.",
        "All user-facing text for the setting is in English."
      ]
    },
    {
      "id": "REQ-86",
      "text": "Expose the OMNIBRAIN runtime mode toggle in Settings (within or near the existing “External AI (OpenAI)” section), using clear English labels and helper text that sets expectations for the current build.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Want to add a toggle in Settings so you can switch between local and API modes easily?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Settings shows a control that allows selecting between “Local (Offline)” and “API (Online)”.",
        "Because this build does not support external AI network calls, the “API (Online)” option is visibly marked as unavailable (e.g., disabled and/or with helper text explaining it is not supported in this build).",
        "The existing Settings messaging that “No API keys are accepted, and OMNIBRAIN makes no network calls” remains true after this change."
      ]
    },
    {
      "id": "REQ-87",
      "text": "Wire OMNIBRAIN chat behavior to the selected runtime mode: in “Local (Offline)”, keep current deterministic local-data + knowledge-base responses; in “API (Online)” (unavailable), OMNIBRAIN must respond deterministically with the existing external-AI-unavailable explanation (and suggested follow-ups) rather than attempting any network call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "…wired up—ready for you to test the OpenAI fallback.",
          "…toggle in Settings so you can switch between local and API modes easily?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When runtime mode is “Local (Offline)”, OMNIBRAIN responses behave exactly as before this change (deterministic local intents + help search + fallback).",
        "When runtime mode is “API (Online)” (unavailable), submitting any question produces the deterministic external-AI-unavailable response (no network call).",
        "No new external network requests are introduced in OMNIBRAIN as part of this change."
      ]
    },
    {
      "id": "REQ-88",
      "text": "Surface the currently selected OMNIBRAIN runtime mode in the OMNIBRAIN screen UI in a low-noise way (e.g., a small badge/label near the header), using English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "…toggle in Settings so you can switch between local and API modes easily?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "OMNIBRAIN screen shows the current runtime mode label (e.g., “Mode: Local (Offline)” or “Mode: API (Online)”).",
        "If the user selects “API (Online)”, the UI indicates it is unavailable in this build (consistent with Settings).",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not add any real OpenAI/Anthropic/LLM API integration or network calls; the current build must remain offline-only.",
    "Do not modify files under frontend/src/components/ui (read-only shadcn components).",
    "Keep the backend as-is; no new backend endpoints or schema changes are required for this toggle."
  ],
  "nonGoals": [
    "Accepting/storing user-provided API keys.",
    "Implementing real external AI responses.",
    "Changing existing OMNIBRAIN deterministic intent detection or analytics facts beyond what is necessary to respect the selected runtime mode."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}