{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "OMNIBRAIN runtime mode toggle (Local vs API-unavailable) with local persistence and UI surfacing",
  "requirements": [
    {
      "id": "REQ-85",
      "summary": "Create a device-local OMNIBRAIN runtime mode setting (Local vs API) persisted in localStorage with safe defaults and immediate in-app updates.",
      "acceptanceCriteria": [
        "A new localStorage key is used to store the selected OMNIBRAIN runtime mode.",
        "Default mode is “Local (Offline)” when no prior selection exists or stored value is invalid.",
        "Changing the mode updates immediately without requiring a page refresh.",
        "All user-facing text for the setting is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/omni/hooks/useOmniBrainRuntimeMode.ts",
          "operation": "create",
          "description": "Implement a dedicated React hook for OMNIBRAIN runtime mode with: (1) a new localStorage key, (2) strict validation + fallback to “Local (Offline)” on missing/invalid values, and (3) immediate cross-component updates via an in-app event/subscription mechanism (and optionally the browser 'storage' event) so changes propagate without refresh."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Expose the OMNIBRAIN runtime mode toggle inside Settings near the existing External AI (OpenAI) section, with clear English labels and an unavailable/disabled API option explanation.",
      "acceptanceCriteria": [
        "Settings shows a control that allows selecting between “Local (Offline)” and “API (Online)”.",
        "Because this build does not support external AI network calls, the “API (Online)” option is visibly marked as unavailable (e.g., disabled and/or with helper text explaining it is not supported in this build).",
        "The existing Settings messaging that “No API keys are accepted, and OMNIBRAIN makes no network calls” remains true after this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "modify",
          "description": "Add an OMNIBRAIN Runtime Mode control within/near the existing “External AI (OpenAI)” card using existing shadcn-ui components (e.g., Select/Badge/text) without modifying any files under frontend/src/components/ui. The control must present “Local (Offline)” and a visibly unavailable “API (Online)” option (disabled and/or clearly labeled as not supported in this build), and include helper text that preserves and reinforces the current offline-only guarantee. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/omni/hooks/useOmniBrainRuntimeMode.ts",
          "operation": "modify",
          "description": "Export runtime-mode labels/helpers (English strings) suitable for Settings UI reuse (e.g., display label for current mode, and an 'unavailable' note for API mode) while keeping Local (Offline) as the validated default."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "Respect selected runtime mode in OMNIBRAIN chat: keep current local deterministic behavior for Local mode; return deterministic external-AI-unavailable response for API mode without any network calls.",
      "acceptanceCriteria": [
        "When runtime mode is “Local (Offline)”, OMNIBRAIN responses behave exactly as before this change (deterministic local intents + help search + fallback).",
        "When runtime mode is “API (Online)” (unavailable), submitting any question produces the deterministic external-AI-unavailable response (no network call).",
        "No new external network requests are introduced in OMNIBRAIN as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/omni/omnibrain/engine.ts",
          "operation": "modify",
          "description": "Expose a public, deterministic helper for the existing external-AI-unavailable response generation so the UI can force this reply when runtime mode is set to “API (Online)”, without introducing any network behavior."
        },
        {
          "path": "frontend/src/screens/OmniBrainScreen.tsx",
          "operation": "modify",
          "description": "Wire chat submit flow to runtime mode: if mode is “Local (Offline)”, keep the current behavior unchanged; if mode is “API (Online)” (unavailable), bypass local intent/data processing and deterministically return the existing external-AI-unavailable response helper (no network calls). Also subscribe to runtime mode changes via the new hook so behavior updates immediately. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-88",
      "summary": "Show the currently selected OMNIBRAIN runtime mode on the OMNIBRAIN screen as a low-noise English badge/label, including an unavailable indicator for API mode.",
      "acceptanceCriteria": [
        "OMNIBRAIN screen shows the current runtime mode label (e.g., “Mode: Local (Offline)” or “Mode: API (Online)”).",
        "If the user selects “API (Online)”, the UI indicates it is unavailable in this build (consistent with Settings).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/OmniBrainScreen.tsx",
          "operation": "modify",
          "description": "Add a small runtime-mode label/badge near the OMNIBRAIN header that reads “Mode: Local (Offline)” or “Mode: API (Online)” and, when API is selected, clearly indicates “Unavailable in this build” consistent with Settings. Use existing shadcn-ui Badge/text styling without touching frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}